[
  {
    "slug": "how-many-subscriptions-are-enough",
    "title": "How many subscriptions are enough?",
    "date": "2026-01-09",
    "excerpt": "A reflection on the endless treadmill of subscription services and the moment of awareness when you notice the silent hum of perpetual upkeep—when nothing ever finishes.",
    "readTime": "3 min read"
  },
  {
    "slug": "castles-of-worry",
    "title": "Castles of Worry",
    "date": "2025-11-13",
    "excerpt": "Gentleness clears the noise so we can dismantle the imaginary castles of worry and rebuild with intention.",
    "readTime": "4 min read"
  },
  {
    "slug": "write-more-to-think-more",
    "title": "Write more to think more",
    "date": "2025-10-31",
    "excerpt": "In similar ways, I think ChatGPT is bringing the marginal cost of ‘thinking’ to zero, but it seems we’re losing the ‘what to think about and how’ also with it. Is that the price to pay?",
    "readTime": "2 min read"
  },
  {
    "slug": "why-im-interested-in-cryptography-quantum-computing-and-ai",
    "title": "Why I'm Interested in Cryptography, Quantum Computing and AI",
    "date": "2025-10-30",
    "excerpt": "A personal exploration of how my journey through history, journalism, entrepreneurship, and Web3 led me to these three converging technologies.",
    "readTime": "5 min read"
  },
  {
    "slug": "elons-algorithm-a-spacex-engineers-perspective",
    "title": "On Elon's Algorithm",
    "date": "2025-10-20",
    "excerpt": "Elon has a 5-step algorithm to run companies and build products. But what does it really do?",
    "readTime": "15 min read"
  },
  {
    "slug": "the-productivity-myth-ft-vibe-coding",
    "title": "The Productivity Myth (ft. Vibe Coding)",
    "date": "2025-10-10",
    "excerpt": "Lately, I've been building small apps using Cursor. It's been oddly satisfying. I guess the kids call it 'vibe coding,' but something strange started happening that I couldn't ignore.",
    "readTime": "3 min read"
  },
  {
    "slug": "prediction-markets-are-trending-heres-my-experience",
    "title": "Prediction Markets are Trending. Here's my Experience Building One.",
    "date": "2025-09-25",
    "excerpt": "Late 2023 to early 2024, I spent 6 months trying to build a prediction markets product called Ariina. At its peak, we had about 600 users in beta. I failed miserably but here is what I learned about market discovery, creation, liquidity, resolution, and contextualization.",
    "readTime": "8 min read"
  },
  {
    "slug": "the-biggest-challenge-facing-llms",
    "title": "The Biggest Challenge Facing LLMs",
    "date": "2025-09-19",
    "excerpt": "One thing that's common among recent statements by leads of all top AI labs is that they've used all the publicly available data for training frontier models. The next frontier is private, proprietary data.",
    "readTime": "4 min read"
  },
  {
    "slug": "why-im-excited-about-morpho-on-base",
    "title": "Why I'm excited about Morpho on Base",
    "date": "2025-09-03",
    "excerpt": "I recently learned that Coinbase lets you borrow money using Bitcoin as collateral (powered by Morpho). This led me down the Morpho rabbit hole and I was surprised to learn that there's a lot I didn't know about them.",
    "readTime": "5 min read"
  },
  {
    "slug": "jevons-paradox-and-fhe",
    "title": "Jevon's Paradox and FHE",
    "date": "2025-08-21",
    "excerpt": "Jevon's paradox is an economic principle that states that when technological advancements increase the efficiency with which a resource is used, the overall consumption of that resource may increase rather than decrease. I believe we're witnessing something similar with FHE.",
    "readTime": "3 min read"
  },
  {
    "slug": "what-i-like-and-dont-like-about-circles-new-blockchain-arc",
    "title": "What I like and Don't like about Circle's new blockchain Arc",
    "date": "2025-08-13",
    "excerpt": "I read the Arc litepaper so you don't have to. When my friend Sanket and his cracked team joined Circle a few months back, I knew something new was coming. Well, now Arc is here and here's what stands out for me.",
    "readTime": "6 min read"
  },
  {
    "slug": "state-of-fhe-2025",
    "title": "State of FHE | 2025",
    "date": "2025-08-09",
    "excerpt": "Imagine being able to compute on secrets, without ever seeing them. That's the magic of Fully Homomorphic Encryption (FHE), a cryptography technique that lets you process encrypted data as if it were unlocked. It's privacy's holy grail.",
    "readTime": "7 min read"
  }
]